Ran Plan for dir: `terragrunt/kubernetes/renovate` workspace: `terragrunt_kubernetes_renovate`

<details><summary>Show Output</summary>

```diff
Authenticated

01:02:06.993 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/sGS9R03JY2RHm0jPI3wgvITtGek/gXp2zwHbyatzNZgcBl4t1bCIc-s
01:02:07.020 INFO   tofu: Initializing the backend...
01:02:07.294 INFO   tofu: Initializing provider plugins...
01:02:07.294 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:02:07.492 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:02:07.585 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:02:07.737 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:02:07.830 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:02:07.989 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:02:08.116 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:02:08.236 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:02:08.422 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:02:08.442 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:02:08.453 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:02:08.484 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:02:08.518 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:02:08.538 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
01:02:08.573 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:02:08.587 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:02:08.587 INFO   tofu: OpenTofu has been successfully initialized!
01:02:09.250 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:02:09.250 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:02:09.250 STDOUT tofu:   ~ update in-place
01:02:09.250 STDOUT tofu: OpenTofu will perform the following actions:
01:02:09.250 STDOUT tofu:   # helm_release.renovate will be updated in-place
01:02:09.250 STDOUT tofu:   ~ resource "helm_release" "renovate" {
01:02:09.250 STDOUT tofu:       ~ id                         = "renovate" -> (known after apply)
01:02:09.251 STDOUT tofu:       ~ metadata                   = {
01:02:09.251 STDOUT tofu:           ~ app_version    = "40.18.1" -> (known after apply)
01:02:09.251 STDOUT tofu:           ~ chart          = "renovate" -> (known after apply)
01:02:09.251 STDOUT tofu:           ~ first_deployed = 1746674676 -> (known after apply)
01:02:09.251 STDOUT tofu:           ~ last_deployed  = 1747703014 -> (known after apply)
01:02:09.251 STDOUT tofu:           ~ name           = "renovate" -> (known after apply)
01:02:09.251 STDOUT tofu:           ~ namespace      = "renovate" -> (known after apply)
01:02:09.251 STDOUT tofu:           ~ revision       = 13 -> (known after apply)
01:02:09.251 STDOUT tofu:           ~ values         = jsonencode(
01:02:09.251 STDOUT tofu:                 {
01:02:09.251 STDOUT tofu:                   - envFrom  = [
01:02:09.251 STDOUT tofu:                       - {
01:02:09.251 STDOUT tofu:                           - secretRef = {
01:02:09.251 STDOUT tofu:                               - name = "renovate-env"
01:02:09.251 STDOUT tofu:                             }
01:02:09.251 STDOUT tofu:                         },
01:02:09.251 STDOUT tofu:                     ]
01:02:09.251 STDOUT tofu:                   - renovate = {
01:02:09.251 STDOUT tofu:                       - config = jsonencode(
01:02:09.251 STDOUT tofu:                             {
01:02:09.251 STDOUT tofu:                               - gitAuthor    = "YouHide Renovate Bot <youhide_renovate@none.com>"
01:02:09.251 STDOUT tofu:                               - platform     = "github"
01:02:09.251 STDOUT tofu:                               - repositories = [
01:02:09.251 STDOUT tofu:                                   - "youhide/hideForming",
01:02:09.251 STDOUT tofu:                                 ]
01:02:09.251 STDOUT tofu:                             }
01:02:09.251 STDOUT tofu:                         )
01:02:09.251 STDOUT tofu:                     }
01:02:09.251 STDOUT tofu:                 }
01:02:09.251 STDOUT tofu:             ) -> (known after apply)
01:02:09.252 STDOUT tofu:           ~ version        = "40.18.1" -> (known after apply)
01:02:09.252 STDOUT tofu:         } -> (known after apply)
01:02:09.252 STDOUT tofu:         name                       = "renovate"
01:02:09.252 STDOUT tofu:       ~ version                    = "40.18.1" -> "40.21.0"
01:02:09.252 STDOUT tofu:         # (26 unchanged attributes hidden)
01:02:09.252 STDOUT tofu:     }
01:02:09.252 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:02:09.252 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Frenovate%252Fterragrunt_kubernetes_renovate)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```